Attached log output with the change:
```
  # module.consul-exporter.docker_image.myimage must be replaced
-/+ resource "docker_image" "myimage" {
      ~ id            = "sha256:4f069174c935c49e73bff5200d2b57e6ced520d4f3cc9af7ae6e5f7903f7e2f4prom/consul-exporter:v0.7.1" -> (known after apply)
      ~ latest        = "sha256:4f069174c935c49e73bff5200d2b57e6ced520d4f3cc9af7ae6e5f7903f7e2f4" -> (known after apply)
      ~ name          = "prom/consul-exporter:v0.7.1" -> "prom/consul-exporter:v0.7.0" # forces replacement
      + output        = (known after apply)
      ~ repo_digest   = "prom/consul-exporter@sha256:4f069174c935c49e73bff5200d2b57e6ced520d4f3cc9af7ae6e5f7903f7e2f4" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

...

module.consul-exporter.docker_container.instance[0]: Still destroying... [id=2887d557527549fc997ecf208474bd43956960547e864c568904566263bbc1bf, 20s elapsed]
module.consul-exporter.docker_container.instance[0]: Still destroying... [id=2887d557527549fc997ecf208474bd43956960547e864c568904566263bbc1bf, 30s elapsed]
module.consul-exporter.docker_container.instance[0]: Destruction complete after 34s
module.consul-exporter.docker_image.myimage: Destroying... [id=sha256:4f069174c935c49e73bff5200d2b57e6ced520d4f3cc9af7ae6e5f7903f7e2f4prom/consul-exporter:v0.7.1]
module.consul-exporter.docker_image.myimage: Destruction complete after 0s
module.consul-exporter.docker_image.myimage: Creating...
module.consul-exporter.docker_image.myimage: Creation complete after 3s [id=sha256:83c33a3c475b756146a1959440646e9d0ac1d5244227e712083bb38bdced7f44prom/consul-exporter:v0.7.0]
module.consul-exporter.docker_container.instance[0]: Creating...
module.consul-exporter.docker_container.instance[0]: Still creating... [10s elapsed]
module.consul-exporter.docker_container.instance[0]: Still creating... [20s elapsed]
module.consul-exporter.docker_container.instance[0]: Still creating... [30s elapsed]
module.consul-exporter.docker_container.instance[0]: Still creating... [40s elapsed]
module.consul-exporter.docker_container.instance[0]: Still creating... [50s elapsed]
module.consul-exporter.docker_container.instance[0]: Creation complete after 57s [id=15945928c47942cf9063272647e26363afb74b64b6cc4f2fa200e43f2f5cda03]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 2 destroyed.
```